2018-05-12 15:15:39

 
 
 
 model: 0
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_1 (Conv2D)            (None, 80, 80, 8)         152       

_________________________________________________________________

max_pooling2d_1 (MaxPooling2 (None, 40, 40, 8)         0         

_________________________________________________________________

dropout_1 (Dropout)          (None, 40, 40, 8)         0         

_________________________________________________________________

conv2d_2 (Conv2D)            (None, 40, 40, 8)         584       

_________________________________________________________________

max_pooling2d_2 (MaxPooling2 (None, 20, 20, 8)         0         

_________________________________________________________________

dropout_2 (Dropout)          (None, 20, 20, 8)         0         

_________________________________________________________________

conv2d_3 (Conv2D)            (None, 20, 20, 8)         584       

_________________________________________________________________

max_pooling2d_3 (MaxPooling2 (None, 10, 10, 8)         0         

_________________________________________________________________

dropout_3 (Dropout)          (None, 10, 10, 8)         0         

_________________________________________________________________

conv2d_4 (Conv2D)            (None, 10, 10, 8)         584       

_________________________________________________________________

flatten_1 (Flatten)          (None, 800)               0         

_________________________________________________________________

dense_1 (Dense)              (None, 128)               102528    

_________________________________________________________________

dropout_4 (Dropout)          (None, 128)               0         

_________________________________________________________________

dense_2 (Dense)              (None, 128)               16512     

_________________________________________________________________

dense_3 (Dense)              (None, 128)               16512     

_________________________________________________________________

dense_4 (Dense)              (None, 2)                 258       

=================================================================

Total params: 137,714

Trainable params: 137,714

Non-trainable params: 0

_________________________________________________________________

 validation results 0.8636360225703824
 
 
 
 model: 1
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_5 (Conv2D)            (None, 80, 80, 8)         2312      

_________________________________________________________________

max_pooling2d_4 (MaxPooling2 (None, 40, 40, 8)         0         

_________________________________________________________________

dropout_5 (Dropout)          (None, 40, 40, 8)         0         

_________________________________________________________________

conv2d_6 (Conv2D)            (None, 40, 40, 12)        3468      

_________________________________________________________________

max_pooling2d_5 (MaxPooling2 (None, 20, 20, 12)        0         

_________________________________________________________________

dropout_6 (Dropout)          (None, 20, 20, 12)        0         

_________________________________________________________________

conv2d_7 (Conv2D)            (None, 20, 20, 16)        1744      

_________________________________________________________________

max_pooling2d_6 (MaxPooling2 (None, 10, 10, 16)        0         

_________________________________________________________________

dropout_7 (Dropout)          (None, 10, 10, 16)        0         

_________________________________________________________________

conv2d_8 (Conv2D)            (None, 10, 10, 16)        2320      

_________________________________________________________________

max_pooling2d_7 (MaxPooling2 (None, 5, 5, 16)          0         

_________________________________________________________________

dropout_8 (Dropout)          (None, 5, 5, 16)          0         

_________________________________________________________________

conv2d_9 (Conv2D)            (None, 5, 5, 16)          2320      

_________________________________________________________________

max_pooling2d_8 (MaxPooling2 (None, 2, 2, 16)          0         

_________________________________________________________________

dropout_9 (Dropout)          (None, 2, 2, 16)          0         

_________________________________________________________________

conv2d_10 (Conv2D)           (None, 2, 2, 16)          2320      

_________________________________________________________________

flatten_2 (Flatten)          (None, 64)                0         

_________________________________________________________________

dense_5 (Dense)              (None, 256)               16640     

_________________________________________________________________

dropout_10 (Dropout)         (None, 256)               0         

_________________________________________________________________

dense_6 (Dense)              (None, 256)               65792     

_________________________________________________________________

dropout_11 (Dropout)         (None, 256)               0         

_________________________________________________________________

dense_7 (Dense)              (None, 256)               65792     

_________________________________________________________________

dropout_12 (Dropout)         (None, 256)               0         

_________________________________________________________________

dense_8 (Dense)              (None, 2)                 514       

=================================================================

Total params: 163,222

Trainable params: 163,222

Non-trainable params: 0

_________________________________________________________________

 validation results 0.5
 
 
 
 model: 2
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_11 (Conv2D)           (None, 80, 80, 16)        304       

_________________________________________________________________

max_pooling2d_9 (MaxPooling2 (None, 40, 40, 16)        0         

_________________________________________________________________

dropout_13 (Dropout)         (None, 40, 40, 16)        0         

_________________________________________________________________

conv2d_12 (Conv2D)           (None, 40, 40, 16)        2320      

_________________________________________________________________

max_pooling2d_10 (MaxPooling (None, 20, 20, 16)        0         

_________________________________________________________________

dropout_14 (Dropout)         (None, 20, 20, 16)        0         

_________________________________________________________________

conv2d_13 (Conv2D)           (None, 20, 20, 16)        2320      

_________________________________________________________________

max_pooling2d_11 (MaxPooling (None, 10, 10, 16)        0         

_________________________________________________________________

dropout_15 (Dropout)         (None, 10, 10, 16)        0         

_________________________________________________________________

conv2d_14 (Conv2D)           (None, 10, 10, 16)        2320      

_________________________________________________________________

flatten_3 (Flatten)          (None, 1600)              0         

_________________________________________________________________

dense_9 (Dense)              (None, 128)               204928    

_________________________________________________________________

dense_10 (Dense)             (None, 64)                8256      

_________________________________________________________________

dense_11 (Dense)             (None, 64)                4160      

_________________________________________________________________

dense_12 (Dense)             (None, 32)                2080      

_________________________________________________________________

dense_13 (Dense)             (None, 2)                 66        

=================================================================

Total params: 226,754

Trainable params: 226,754

Non-trainable params: 0

_________________________________________________________________

 validation results 0.4999999999994099
 
 
 
 model: 3
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_15 (Conv2D)           (None, 80, 80, 13)        949       

_________________________________________________________________

max_pooling2d_12 (MaxPooling (None, 40, 40, 13)        0         

_________________________________________________________________

dropout_16 (Dropout)         (None, 40, 40, 13)        0         

_________________________________________________________________

conv2d_16 (Conv2D)           (None, 40, 40, 9)         4221      

_________________________________________________________________

max_pooling2d_13 (MaxPooling (None, 20, 20, 9)         0         

_________________________________________________________________

dropout_17 (Dropout)         (None, 20, 20, 9)         0         

_________________________________________________________________

conv2d_17 (Conv2D)           (None, 20, 20, 17)        5525      

_________________________________________________________________

max_pooling2d_14 (MaxPooling (None, 10, 10, 17)        0         

_________________________________________________________________

dropout_18 (Dropout)         (None, 10, 10, 17)        0         

_________________________________________________________________

conv2d_18 (Conv2D)           (None, 10, 10, 3)         1839      

_________________________________________________________________

max_pooling2d_15 (MaxPooling (None, 5, 5, 3)           0         

_________________________________________________________________

dropout_19 (Dropout)         (None, 5, 5, 3)           0         

_________________________________________________________________

conv2d_19 (Conv2D)           (None, 5, 5, 19)          2071      

_________________________________________________________________

max_pooling2d_16 (MaxPooling (None, 2, 2, 19)          0         

_________________________________________________________________

dropout_20 (Dropout)         (None, 2, 2, 19)          0         

_________________________________________________________________

flatten_4 (Flatten)          (None, 76)                0         

_________________________________________________________________

dense_14 (Dense)             (None, 256)               19712     

_________________________________________________________________

dense_15 (Dense)             (None, 512)               131584    

_________________________________________________________________

dense_16 (Dense)             (None, 128)               65664     

_________________________________________________________________

dense_17 (Dense)             (None, 2)                 258       

=================================================================

Total params: 231,823

Trainable params: 231,823

Non-trainable params: 0

_________________________________________________________________
