2018-05-15 22:55:27

 
 
 
 model: 0
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_1 (Conv2D)            (None, 80, 80, 13)        949       

_________________________________________________________________

max_pooling2d_1 (MaxPooling2 (None, 40, 40, 13)        0         

_________________________________________________________________

dropout_1 (Dropout)          (None, 40, 40, 13)        0         

_________________________________________________________________

conv2d_2 (Conv2D)            (None, 40, 40, 9)         4221      

_________________________________________________________________

max_pooling2d_2 (MaxPooling2 (None, 20, 20, 9)         0         

_________________________________________________________________

dropout_2 (Dropout)          (None, 20, 20, 9)         0         

_________________________________________________________________

conv2d_3 (Conv2D)            (None, 20, 20, 17)        5525      

_________________________________________________________________

max_pooling2d_3 (MaxPooling2 (None, 10, 10, 17)        0         

_________________________________________________________________

dropout_3 (Dropout)          (None, 10, 10, 17)        0         

_________________________________________________________________

conv2d_4 (Conv2D)            (None, 10, 10, 3)         1839      

_________________________________________________________________

max_pooling2d_4 (MaxPooling2 (None, 5, 5, 3)           0         

_________________________________________________________________

dropout_4 (Dropout)          (None, 5, 5, 3)           0         

_________________________________________________________________

conv2d_5 (Conv2D)            (None, 5, 5, 19)          2071      

_________________________________________________________________

max_pooling2d_5 (MaxPooling2 (None, 2, 2, 19)          0         

_________________________________________________________________

dropout_5 (Dropout)          (None, 2, 2, 19)          0         

_________________________________________________________________

flatten_1 (Flatten)          (None, 76)                0         

_________________________________________________________________

dense_1 (Dense)              (None, 256)               19712     

_________________________________________________________________

dense_2 (Dense)              (None, 512)               131584    

_________________________________________________________________

dense_3 (Dense)              (None, 128)               65664     

_________________________________________________________________

dense_4 (Dense)              (None, 2)                 258       

=================================================================

Total params: 231,823

Trainable params: 231,823

Non-trainable params: 0

_________________________________________________________________
