2018-05-17 12:37:39

 
 
 
 model: 0
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_1 (Conv2D)            (None, 80, 80, 4)         76        

_________________________________________________________________

max_pooling2d_1 (MaxPooling2 (None, 40, 40, 4)         0         

_________________________________________________________________

dropout_1 (Dropout)          (None, 40, 40, 4)         0         

_________________________________________________________________

conv2d_2 (Conv2D)            (None, 40, 40, 4)         148       

_________________________________________________________________

max_pooling2d_2 (MaxPooling2 (None, 20, 20, 4)         0         

_________________________________________________________________

dropout_2 (Dropout)          (None, 20, 20, 4)         0         

_________________________________________________________________

flatten_1 (Flatten)          (None, 1600)              0         

_________________________________________________________________

dense_1 (Dense)              (None, 64)                102464    

_________________________________________________________________

dropout_3 (Dropout)          (None, 64)                0         

_________________________________________________________________

dense_2 (Dense)              (None, 64)                4160      

_________________________________________________________________

dropout_4 (Dropout)          (None, 64)                0         

_________________________________________________________________

dense_3 (Dense)              (None, 2)                 130       

=================================================================

Total params: 106,978

Trainable params: 106,978

Non-trainable params: 0

_________________________________________________________________

 validation results 0.0
 
 
 
 model: 1
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_3 (Conv2D)            (None, 80, 80, 4)         76        

_________________________________________________________________

max_pooling2d_3 (MaxPooling2 (None, 40, 40, 4)         0         

_________________________________________________________________

dropout_5 (Dropout)          (None, 40, 40, 4)         0         

_________________________________________________________________

conv2d_4 (Conv2D)            (None, 40, 40, 4)         148       

_________________________________________________________________

max_pooling2d_4 (MaxPooling2 (None, 20, 20, 4)         0         

_________________________________________________________________

dropout_6 (Dropout)          (None, 20, 20, 4)         0         

_________________________________________________________________

flatten_2 (Flatten)          (None, 1600)              0         

_________________________________________________________________

dense_4 (Dense)              (None, 64)                102464    

_________________________________________________________________

dropout_7 (Dropout)          (None, 64)                0         

_________________________________________________________________

dense_5 (Dense)              (None, 64)                4160      

_________________________________________________________________

dropout_8 (Dropout)          (None, 64)                0         

_________________________________________________________________

dense_6 (Dense)              (None, 2)                 130       

=================================================================

Total params: 106,978

Trainable params: 106,978

Non-trainable params: 0

_________________________________________________________________

 validation results 0.0
 
 
 
 model: 2
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_5 (Conv2D)            (None, 80, 80, 8)         152       

_________________________________________________________________

max_pooling2d_5 (MaxPooling2 (None, 40, 40, 8)         0         

_________________________________________________________________

dropout_9 (Dropout)          (None, 40, 40, 8)         0         

_________________________________________________________________

conv2d_6 (Conv2D)            (None, 40, 40, 8)         584       

_________________________________________________________________

max_pooling2d_6 (MaxPooling2 (None, 20, 20, 8)         0         

_________________________________________________________________

dropout_10 (Dropout)         (None, 20, 20, 8)         0         

_________________________________________________________________

flatten_3 (Flatten)          (None, 3200)              0         

_________________________________________________________________

dense_7 (Dense)              (None, 128)               409728    

_________________________________________________________________

dropout_11 (Dropout)         (None, 128)               0         

_________________________________________________________________

dense_8 (Dense)              (None, 128)               16512     

_________________________________________________________________

dropout_12 (Dropout)         (None, 128)               0         

_________________________________________________________________

dense_9 (Dense)              (None, 2)                 258       

=================================================================

Total params: 427,234

Trainable params: 427,234

Non-trainable params: 0

_________________________________________________________________

 validation results 0.0
 
 
 
 model: 3
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_7 (Conv2D)            (None, 80, 80, 8)         152       

_________________________________________________________________

max_pooling2d_7 (MaxPooling2 (None, 40, 40, 8)         0         

_________________________________________________________________

dropout_13 (Dropout)         (None, 40, 40, 8)         0         

_________________________________________________________________

conv2d_8 (Conv2D)            (None, 40, 40, 8)         584       

_________________________________________________________________

max_pooling2d_8 (MaxPooling2 (None, 20, 20, 8)         0         

_________________________________________________________________

dropout_14 (Dropout)         (None, 20, 20, 8)         0         

_________________________________________________________________

flatten_4 (Flatten)          (None, 3200)              0         

_________________________________________________________________

dense_10 (Dense)             (None, 128)               409728    

_________________________________________________________________

dropout_15 (Dropout)         (None, 128)               0         

_________________________________________________________________

dense_11 (Dense)             (None, 128)               16512     

_________________________________________________________________

dropout_16 (Dropout)         (None, 128)               0         

_________________________________________________________________

dense_12 (Dense)             (None, 2)                 258       

=================================================================

Total params: 427,234

Trainable params: 427,234

Non-trainable params: 0

_________________________________________________________________

 validation results 0.0
 
 
 
 model: 4
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_9 (Conv2D)            (None, 80, 80, 4)         76        

_________________________________________________________________

max_pooling2d_9 (MaxPooling2 (None, 40, 40, 4)         0         

_________________________________________________________________

dropout_17 (Dropout)         (None, 40, 40, 4)         0         

_________________________________________________________________

conv2d_10 (Conv2D)           (None, 40, 40, 4)         148       

_________________________________________________________________

max_pooling2d_10 (MaxPooling (None, 20, 20, 4)         0         

_________________________________________________________________

dropout_18 (Dropout)         (None, 20, 20, 4)         0         

_________________________________________________________________

conv2d_11 (Conv2D)           (None, 20, 20, 4)         148       

_________________________________________________________________

max_pooling2d_11 (MaxPooling (None, 10, 10, 4)         0         

_________________________________________________________________

dropout_19 (Dropout)         (None, 10, 10, 4)         0         

_________________________________________________________________

flatten_5 (Flatten)          (None, 400)               0         

_________________________________________________________________

dense_13 (Dense)             (None, 128)               51328     

_________________________________________________________________

dropout_20 (Dropout)         (None, 128)               0         

_________________________________________________________________

dense_14 (Dense)             (None, 128)               16512     

_________________________________________________________________

dropout_21 (Dropout)         (None, 128)               0         

_________________________________________________________________

dense_15 (Dense)             (None, 128)               16512     

_________________________________________________________________

dropout_22 (Dropout)         (None, 128)               0         

_________________________________________________________________

dense_16 (Dense)             (None, 2)                 258       

=================================================================

Total params: 84,982

Trainable params: 84,982

Non-trainable params: 0

_________________________________________________________________

 validation results 0.0
 
 
 
 model: 5
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_12 (Conv2D)           (None, 80, 80, 4)         76        

_________________________________________________________________

max_pooling2d_12 (MaxPooling (None, 40, 40, 4)         0         

_________________________________________________________________

dropout_23 (Dropout)         (None, 40, 40, 4)         0         

_________________________________________________________________

conv2d_13 (Conv2D)           (None, 40, 40, 4)         148       

_________________________________________________________________

max_pooling2d_13 (MaxPooling (None, 20, 20, 4)         0         

_________________________________________________________________

dropout_24 (Dropout)         (None, 20, 20, 4)         0         

_________________________________________________________________

conv2d_14 (Conv2D)           (None, 20, 20, 4)         148       

_________________________________________________________________

max_pooling2d_14 (MaxPooling (None, 10, 10, 4)         0         

_________________________________________________________________

dropout_25 (Dropout)         (None, 10, 10, 4)         0         

_________________________________________________________________

flatten_6 (Flatten)          (None, 400)               0         

_________________________________________________________________

dense_17 (Dense)             (None, 128)               51328     

_________________________________________________________________

dropout_26 (Dropout)         (None, 128)               0         

_________________________________________________________________

dense_18 (Dense)             (None, 128)               16512     

_________________________________________________________________

dropout_27 (Dropout)         (None, 128)               0         

_________________________________________________________________

dense_19 (Dense)             (None, 128)               16512     

_________________________________________________________________

dropout_28 (Dropout)         (None, 128)               0         

_________________________________________________________________

dense_20 (Dense)             (None, 2)                 258       

=================================================================

Total params: 84,982

Trainable params: 84,982

Non-trainable params: 0

_________________________________________________________________

 validation results 0.0
 
 
 
 model: 6
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_15 (Conv2D)           (None, 80, 80, 8)         152       

_________________________________________________________________

max_pooling2d_15 (MaxPooling (None, 40, 40, 8)         0         

_________________________________________________________________

dropout_29 (Dropout)         (None, 40, 40, 8)         0         

_________________________________________________________________

conv2d_16 (Conv2D)           (None, 40, 40, 8)         584       

_________________________________________________________________

max_pooling2d_16 (MaxPooling (None, 20, 20, 8)         0         

_________________________________________________________________

dropout_30 (Dropout)         (None, 20, 20, 8)         0         

_________________________________________________________________

conv2d_17 (Conv2D)           (None, 20, 20, 8)         584       

_________________________________________________________________

max_pooling2d_17 (MaxPooling (None, 10, 10, 8)         0         

_________________________________________________________________

dropout_31 (Dropout)         (None, 10, 10, 8)         0         

_________________________________________________________________

flatten_7 (Flatten)          (None, 800)               0         

_________________________________________________________________

dense_21 (Dense)             (None, 256)               205056    

_________________________________________________________________

dropout_32 (Dropout)         (None, 256)               0         

_________________________________________________________________

dense_22 (Dense)             (None, 256)               65792     

_________________________________________________________________

dropout_33 (Dropout)         (None, 256)               0         

_________________________________________________________________

dense_23 (Dense)             (None, 2)                 514       

=================================================================

Total params: 272,682

Trainable params: 272,682

Non-trainable params: 0

_________________________________________________________________

 validation results 0.0
 
 
 
 model: 7
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_18 (Conv2D)           (None, 80, 80, 8)         584       

_________________________________________________________________

max_pooling2d_18 (MaxPooling (None, 40, 40, 8)         0         

_________________________________________________________________

dropout_34 (Dropout)         (None, 40, 40, 8)         0         

_________________________________________________________________

conv2d_19 (Conv2D)           (None, 40, 40, 8)         2312      

_________________________________________________________________

max_pooling2d_19 (MaxPooling (None, 20, 20, 8)         0         

_________________________________________________________________

dropout_35 (Dropout)         (None, 20, 20, 8)         0         

_________________________________________________________________

conv2d_20 (Conv2D)           (None, 20, 20, 8)         2312      

_________________________________________________________________

max_pooling2d_20 (MaxPooling (None, 10, 10, 8)         0         

_________________________________________________________________

dropout_36 (Dropout)         (None, 10, 10, 8)         0         

_________________________________________________________________

flatten_8 (Flatten)          (None, 800)               0         

_________________________________________________________________

dense_24 (Dense)             (None, 256)               205056    

_________________________________________________________________

dropout_37 (Dropout)         (None, 256)               0         

_________________________________________________________________

dense_25 (Dense)             (None, 256)               65792     

_________________________________________________________________

dropout_38 (Dropout)         (None, 256)               0         

_________________________________________________________________

dense_26 (Dense)             (None, 2)                 514       

=================================================================

Total params: 276,570

Trainable params: 276,570

Non-trainable params: 0

_________________________________________________________________

 validation results 0.0
 
 
 
 model: 8
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_21 (Conv2D)           (None, 80, 80, 16)        1168      

_________________________________________________________________

max_pooling2d_21 (MaxPooling (None, 40, 40, 16)        0         

_________________________________________________________________

dropout_39 (Dropout)         (None, 40, 40, 16)        0         

_________________________________________________________________

conv2d_22 (Conv2D)           (None, 40, 40, 8)         4616      

_________________________________________________________________

max_pooling2d_22 (MaxPooling (None, 20, 20, 8)         0         

_________________________________________________________________

dropout_40 (Dropout)         (None, 20, 20, 8)         0         

_________________________________________________________________

conv2d_23 (Conv2D)           (None, 20, 20, 8)         2312      

_________________________________________________________________

max_pooling2d_23 (MaxPooling (None, 10, 10, 8)         0         

_________________________________________________________________

dropout_41 (Dropout)         (None, 10, 10, 8)         0         

_________________________________________________________________

flatten_9 (Flatten)          (None, 800)               0         

_________________________________________________________________

dense_27 (Dense)             (None, 256)               205056    

_________________________________________________________________

dropout_42 (Dropout)         (None, 256)               0         

_________________________________________________________________

dense_28 (Dense)             (None, 256)               65792     

_________________________________________________________________

dropout_43 (Dropout)         (None, 256)               0         

_________________________________________________________________

dense_29 (Dense)             (None, 128)               32896     

_________________________________________________________________

dropout_44 (Dropout)         (None, 128)               0         

_________________________________________________________________

dense_30 (Dense)             (None, 2)                 258       

=================================================================

Total params: 312,098

Trainable params: 312,098

Non-trainable params: 0

_________________________________________________________________
