2018-05-15 22:33:28

 
 
 
 model: 0
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_1 (Conv2D)            (None, 80, 80, 16)        304       

_________________________________________________________________

max_pooling2d_1 (MaxPooling2 (None, 40, 40, 16)        0         

_________________________________________________________________

dropout_1 (Dropout)          (None, 40, 40, 16)        0         

_________________________________________________________________

conv2d_2 (Conv2D)            (None, 40, 40, 16)        2320      

_________________________________________________________________

max_pooling2d_2 (MaxPooling2 (None, 20, 20, 16)        0         

_________________________________________________________________

dropout_2 (Dropout)          (None, 20, 20, 16)        0         

_________________________________________________________________

conv2d_3 (Conv2D)            (None, 20, 20, 16)        2320      

_________________________________________________________________

max_pooling2d_3 (MaxPooling2 (None, 10, 10, 16)        0         

_________________________________________________________________

dropout_3 (Dropout)          (None, 10, 10, 16)        0         

_________________________________________________________________

conv2d_4 (Conv2D)            (None, 10, 10, 16)        2320      

_________________________________________________________________

flatten_1 (Flatten)          (None, 1600)              0         

_________________________________________________________________

dense_1 (Dense)              (None, 128)               204928    

_________________________________________________________________

dropout_4 (Dropout)          (None, 128)               0         

_________________________________________________________________

dense_2 (Dense)              (None, 128)               16512     

_________________________________________________________________

dense_3 (Dense)              (None, 128)               16512     

_________________________________________________________________

dense_4 (Dense)              (None, 2)                 258       

=================================================================

Total params: 245,474

Trainable params: 245,474

Non-trainable params: 0

_________________________________________________________________

 validation results 0.0
 
 
 
 model: 1
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_5 (Conv2D)            (None, 80, 80, 32)        608       

_________________________________________________________________

max_pooling2d_4 (MaxPooling2 (None, 40, 40, 32)        0         

_________________________________________________________________

dropout_5 (Dropout)          (None, 40, 40, 32)        0         

_________________________________________________________________

conv2d_6 (Conv2D)            (None, 40, 40, 32)        9248      

_________________________________________________________________

max_pooling2d_5 (MaxPooling2 (None, 20, 20, 32)        0         

_________________________________________________________________

dropout_6 (Dropout)          (None, 20, 20, 32)        0         

_________________________________________________________________

conv2d_7 (Conv2D)            (None, 20, 20, 16)        4624      

_________________________________________________________________

max_pooling2d_6 (MaxPooling2 (None, 10, 10, 16)        0         

_________________________________________________________________

dropout_7 (Dropout)          (None, 10, 10, 16)        0         

_________________________________________________________________

conv2d_8 (Conv2D)            (None, 10, 10, 16)        2320      

_________________________________________________________________

flatten_2 (Flatten)          (None, 1600)              0         

_________________________________________________________________

dense_5 (Dense)              (None, 256)               409856    

_________________________________________________________________

dropout_8 (Dropout)          (None, 256)               0         

_________________________________________________________________

dense_6 (Dense)              (None, 256)               65792     

_________________________________________________________________

dropout_9 (Dropout)          (None, 256)               0         

_________________________________________________________________

dense_7 (Dense)              (None, 256)               65792     

_________________________________________________________________

dropout_10 (Dropout)         (None, 256)               0         

_________________________________________________________________

dense_8 (Dense)              (None, 2)                 514       

=================================================================

Total params: 558,754

Trainable params: 558,754

Non-trainable params: 0

_________________________________________________________________

 validation results 0.0
 
 
 
 model: 2
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_9 (Conv2D)            (None, 80, 80, 8)         2312      

_________________________________________________________________

max_pooling2d_7 (MaxPooling2 (None, 40, 40, 8)         0         

_________________________________________________________________

dropout_11 (Dropout)         (None, 40, 40, 8)         0         

_________________________________________________________________

conv2d_10 (Conv2D)           (None, 40, 40, 12)        3468      

_________________________________________________________________

max_pooling2d_8 (MaxPooling2 (None, 20, 20, 12)        0         

_________________________________________________________________

dropout_12 (Dropout)         (None, 20, 20, 12)        0         

_________________________________________________________________

conv2d_11 (Conv2D)           (None, 20, 20, 16)        1744      

_________________________________________________________________

max_pooling2d_9 (MaxPooling2 (None, 10, 10, 16)        0         

_________________________________________________________________

dropout_13 (Dropout)         (None, 10, 10, 16)        0         

_________________________________________________________________

conv2d_12 (Conv2D)           (None, 10, 10, 16)        2320      

_________________________________________________________________

max_pooling2d_10 (MaxPooling (None, 5, 5, 16)          0         

_________________________________________________________________

dropout_14 (Dropout)         (None, 5, 5, 16)          0         

_________________________________________________________________

conv2d_13 (Conv2D)           (None, 5, 5, 16)          2320      

_________________________________________________________________

max_pooling2d_11 (MaxPooling (None, 2, 2, 16)          0         

_________________________________________________________________

dropout_15 (Dropout)         (None, 2, 2, 16)          0         

_________________________________________________________________

conv2d_14 (Conv2D)           (None, 2, 2, 16)          2320      

_________________________________________________________________

flatten_3 (Flatten)          (None, 64)                0         

_________________________________________________________________

dense_9 (Dense)              (None, 256)               16640     

_________________________________________________________________

dropout_16 (Dropout)         (None, 256)               0         

_________________________________________________________________

dense_10 (Dense)             (None, 256)               65792     

_________________________________________________________________

dropout_17 (Dropout)         (None, 256)               0         

_________________________________________________________________

dense_11 (Dense)             (None, 256)               65792     

_________________________________________________________________

dropout_18 (Dropout)         (None, 256)               0         

_________________________________________________________________

dense_12 (Dense)             (None, 2)                 514       

=================================================================

Total params: 163,222

Trainable params: 163,222

Non-trainable params: 0

_________________________________________________________________
