2018-05-17 19:58:44

 
 
 
 model: 0
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_1 (Conv2D)            (None, 80, 80, 4)         76        

_________________________________________________________________

max_pooling2d_1 (MaxPooling2 (None, 40, 40, 4)         0         

_________________________________________________________________

dropout_1 (Dropout)          (None, 40, 40, 4)         0         

_________________________________________________________________

conv2d_2 (Conv2D)            (None, 40, 40, 4)         148       

_________________________________________________________________

max_pooling2d_2 (MaxPooling2 (None, 20, 20, 4)         0         

_________________________________________________________________

dropout_2 (Dropout)          (None, 20, 20, 4)         0         

_________________________________________________________________

flatten_1 (Flatten)          (None, 1600)              0         

_________________________________________________________________

dense_1 (Dense)              (None, 64)                102464    

_________________________________________________________________

dropout_3 (Dropout)          (None, 64)                0         

_________________________________________________________________

dense_2 (Dense)              (None, 64)                4160      

_________________________________________________________________

dropout_4 (Dropout)          (None, 64)                0         

_________________________________________________________________

dense_3 (Dense)              (None, 2)                 130       

=================================================================

Total params: 106,978

Trainable params: 106,978

Non-trainable params: 0

_________________________________________________________________
