2018-05-13 12:01:53

 
 
 
 model: 0
_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

conv2d_1 (Conv2D)            (None, 80, 80, 16)        304       

_________________________________________________________________

max_pooling2d_1 (MaxPooling2 (None, 40, 40, 16)        0         

_________________________________________________________________

dropout_1 (Dropout)          (None, 40, 40, 16)        0         

_________________________________________________________________

conv2d_2 (Conv2D)            (None, 40, 40, 16)        2320      

_________________________________________________________________

max_pooling2d_2 (MaxPooling2 (None, 20, 20, 16)        0         

_________________________________________________________________

dropout_2 (Dropout)          (None, 20, 20, 16)        0         

_________________________________________________________________

conv2d_3 (Conv2D)            (None, 20, 20, 16)        2320      

_________________________________________________________________

max_pooling2d_3 (MaxPooling2 (None, 10, 10, 16)        0         

_________________________________________________________________

dropout_3 (Dropout)          (None, 10, 10, 16)        0         

_________________________________________________________________

conv2d_4 (Conv2D)            (None, 10, 10, 16)        2320      

_________________________________________________________________

flatten_1 (Flatten)          (None, 1600)              0         

_________________________________________________________________

dense_1 (Dense)              (None, 128)               204928    

_________________________________________________________________

dropout_4 (Dropout)          (None, 128)               0         

_________________________________________________________________

dense_2 (Dense)              (None, 128)               16512     

_________________________________________________________________

dense_3 (Dense)              (None, 128)               16512     

_________________________________________________________________

dense_4 (Dense)              (None, 2)                 258       

=================================================================

Total params: 245,474

Trainable params: 245,474

Non-trainable params: 0

_________________________________________________________________
